Repository: MorganMWJ/feedback_system
Catalog: technical_work/project_code/locale/*/LC_MESSAGES/django.po
Languages: cy

source: English
cy: Saesneg

source: Welsh
cy: Cymraeg

source: Username
cy: Enw Defnyddiwr

source: Your Username
cy: Eich Enw Defnyddiwr

source: Password
cy: Cyfrinair

source: Your Password
cy: Eich Cyfrinair

source: Lecture/Workshop Title*
cy: Teitl Darlith/y gweithdy*

source: Number of Slides*
cy: Nifer y sleidiau*

source: Extra Notes
cy: Nodiadau Ychwanegol

source: Lecture PDF
cy: Darlith PDF

source: Title here...
cy: Teitl yma...

source: Slide Count here...
cy: Sleid Cyfrifwch yma...

source: Notes here...
cy: Nodiadau yma...

source: Session Code
cy: Cod Sesiwn

source: Code here...
cy: Codwch yma ...

source: Ask a question?
cy: Gofyn cwestiwn?

source: Enter a question or comment
cy: Rhowch gwestiwn neu sylw

source: Feedback for which slide
cy: Adborth ar gyfer y sleid

source: LDAP bind failure perhaps due to authentication error
cy: Mae LDAP yn rhwymo methiant efallai oherwydd gwall dilysu

source: Failed to open socket to server probably because not on university network
cy: Wedi methu agor soced i weinydd mae'n debyg oherwydd nad yw ar rwydwaith y brifysgol

source: Invalid form data
cy: Data ffurflen annilys

source: Slide count extracted from uploaded PDF file
cy: Cyfrif sleidiau wedi'i dynnu o ffeil PDF wedi'i lwytho i fyny

source: There is no PDF associated with this lecture
cy: Nid oes PDF yn gysylltiedig â'r ddarlith hon

source: Please connect to active session with valid feedback code
cy: Cysylltwch â sesiwn weithredol gyda chod adborth dilys

source: Created New Session
cy: Crëwyd Sesiwn Newydd

source: Session
cy: Sesiwn

source: Already running
cy: Eisoes yn rhedeg

source: Started
cy: Dechreuwyd

source: Ended
cy: Diwedd

source: Deleted
cy: Wedi'i ddileu

source: New Code Generated
cy: Cynhyrchu Cod Newydd

source: Lecture is not active
cy: Nid yw darlith yn weithredol

source: Invalid lecture feedback code
cy: Cod adborth adborth annilys

source: Invalid POST Data
cy: Data POST Annilys

source: Session is not active
cy: Nid yw'r sesiwn yn weithredol

source: Please Specify Some Feedback Options
cy: Nodwch rai Opsiynau Adborth

source: General Feedback re-submitted
cy: Ailgyflwyno adborth cyffredinol

source: Slide
cy: Sleid

source: General Feedback submitted
cy: Adborth Cyffredinol a gyflwynwyd

source: Session not currently taking questions
cy: Nid yw'r sesiwn yn cymryd cwestiynau ar hyn o bryd

source: You can only delete questions you have posted
cy: Gallwch ond ddileu cwestiynau rydych chi wedi'u postio

source: Permission Denied
cy: Gwrthodwyd Caniatâd

source: Lecture List
cy: Hanes y Ddarlith

source: Logout
cy: Allgofnodi

source: Connect As User
cy: Cysylltu Fel Defnyddiwr

source: Login As Staff
cy: Mewngofnodi Fel Staff

source: Page Does Not Exist
cy: Dydy Tudalen ddim yn bodoli

source: Lecture Feedback System
cy: System Adborth Darlithoedd

source: Connect
cy: Cyswllt

source: Lecture Feedback
cy: Adborth Darlithoedd

source: View Lecture PDF
cy: Gweld Darlith PDF

source: Disconnect
cy: Datgysylltwch

source: Give Feedback
cy: Rhowch Adborth

source: Submit
cy: Cyflwyno

source: Ask Questions
cy: Gofyn cwestiynau

source: Your Questions
cy: Eich Cwestiynau

source: Remove
cy: Dileu

source: Feedback Detail
cy: Manylion Adborth

source: Lecture Detail
cy: Manylion y Ddarlith

source: Click on a session to view feedback data
cy: Cliciwch ar sesiwn i weld data adborth

source: Your Sessions
cy: Eich Sesiynau

source: Code
cy: Côd

source: Date
cy: Dyddiad

source: Page
cy: Tudalen

source: of
cy: o

source: No Sessions
cy: Dim Sesiynau

source: Confirm Delete
cy: Cadarnhewch Dileu

source: Lecture Feedback Detail
cy: Manylion Adborth Darlithoedd

source: View Feedback
cy: Gweld Adborth

source: Create Session For Feedback
cy: Creu Sesiwn I Adborth

source: Title
cy: Teitl

source: Edit
cy: Golygu

source: Owner
cy: Perchennog

source: No. Slides
cy: Sleidiau Nifer

source: Extract slide count from PDF
cy: Cyfrif sleidiau o PDF

source: Notes
cy: Nodiadau

source: Click on a Session Row
cy: Cliciwch ar Sesiwn Row

source: Edit Lecture
cy: Golygu Darlith

source: Update
cy: Diweddariad

source: New Lecture
cy: Darlith Newydd

source: Search
cy: Chwilio

source: Creation Date
cy: Dyddiad Creu

source: Last Active Date
cy: Dyddiad Actif Diwethaf

source: Delete
cy: Dileu

source: No Lectures
cy: Dim Darlithoedd

source: First
cy: Gyntaf

source: previous
cy: blaenorol

source: next
cy: nesaf

source: Last
cy: Yn olaf

source: Create
cy: Creu

source: Feedback Sessions
cy: Sesiynau Adborth

source: Runtime
cy: Amser rhedeg

source: Session Running
cy: Rhedeg Sesiwn

source: End Session
cy: Sesiwn Diwedd

source: Start Session
cy: Sesiwn Dechrau

source: Merge with Above Session
cy: Cyfuno â Sesiwn Uwch

source: Merge with Below Session
cy: Cyfuno â Sesiwn Islaw

source: Disable
cy: Analluoga

source: Enable
cy: Galluogi

source: Questions
cy: Cwestiynau

source: Generate New Code
cy: Cynhyrchu Cod Newydd

source: Delete Session
cy: Dileu Sesiwn

source: Staff Login
cy: Mewngofnodi Staff

source: Login
cy: Mewngofnodi

source: You are already Logged In
cy: Rydych chi eisoes wedi Mewngofnodi

source: Session's Questions
cy: Cwestiynau'r Sesiwn

source: Disabled
cy: Anabl

source: Mark Reviewed
cy: Adolygiad

source: No Questions for this Session
cy: Dim Cwestiynau ar gyfer y Sesiwn hon
